src/InformationRegisters/ОбщиеРеквизитыДокументов/ОбщиеРеквизитыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбщиеРеквизитыДокументов</name>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСортировки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрагентыДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыОбработкиДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсходящийНомерИДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОригиналПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОригиналПолучил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомер</name>
    <type>
      <types>DefinedType.РегистрационныйНомер</types>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерИДата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СодержитОригинал</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокИсполнения</name>
    <comment>Ожидаемый срок ответа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>КодЯзыка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВДокументах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенныеВебСерверы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПереписке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВПерепискеСРангом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.ТерриторииИПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ОбщиеРеквизитыДокументов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение общего реквизита из регистра.
//
// Параметры:
//  Документ - ссылка на документ, для которого возвращается реквизит.
//  Реквизит - Строка - имя реквизита.
//
// Возвращаемое значение:
//  Произвольный - значение реквизита.
//
Функция ПолучитьОбщийРеквизитДокумента(Документ, Реквизит) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеРеквизитыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи[Реквизит];
	
КонецФункции

// Записывает значение общего реквизита в регистр.
//
// Параметры:
//  Документ - ссылка на документ, для которого записывается реквизит.
//  Реквизит - Строка - имя реквизита.
//  Значение - Произвольный - значение реквизита.
//
Процедура ЗаписатьОбщийРеквизитДокумента(Документ, Реквизит, Значение) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.ОбщиеРеквизитыДокументов.СоздатьНаборЗаписей();
	Набор.Отбор.Документ.Установить(Документ);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.Документ = Документ;
	ИначеЕсли Набор[0][Реквизит] = Значение Тогда
		Возврат;
	КонецЕсли;
	
	Набор[0][Реквизит] = Значение;
	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить(Реквизит);
	Набор.ДополнительныеСвойства.Вставить("ИзмененоЗначение", СписокРеквизитов);
	Набор.Записать();
	
	Делопроизводство.ЗаписатьДанныеДокумента(Документ, Реквизит, Значение);
	
КонецПроцедуры

// Записывает значения общих реквизитов документа в регистр.
//
// Параметры:
//   Документ - СправочникОбъект - документ, чьи реквизиты записываются.
//
Процедура ЗаписатьОбщиеРеквизитыДокумента(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КонтрагентыДляСписков = "";
	Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		КонтрагентыДляСписков = Делопроизводство.ПолучитьКонтрагентовДляСписков(
			Документ.Получатели.Выгрузить(), "Получатель");
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		КонтрагентыДляСписков = Делопроизводство.ПолучитьКонтрагентовДляСписков(
			Документ.Контрагенты.Выгрузить());
	КонецЕсли;
	
	РегистрационныйНомерИДата = "";
	Если ЗначениеЗаполнено(Документ.РегистрационныйНомер)
		И ЗначениеЗаполнено(Документ.ДатаРегистрации) Тогда
		РегистрационныйНомерИДата =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 от %2'"),
			СокрЛП(Документ.РегистрационныйНомер),
			Формат(Документ.ДатаРегистрации, "ДЛФ=D"));
	КонецЕсли;
	
	ИсходящийНомерИДата	= "";
	Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы")
		И ЗначениеЗаполнено(Документ.ИсходящийНомер)
		И ЗначениеЗаполнено(Документ.ИсходящаяДата) Тогда
		ИсходящийНомерИДата =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 от %2'"),
			СокрЛП(Документ.ИсходящийНомер),
			Формат(Документ.ИсходящаяДата, "ДЛФ=D"));
	КонецЕсли;
	
	ДатаСортировки = '00010101';
	Если ЗначениеЗаполнено(Документ.ДатаРегистрации) Тогда 
		ДатаСортировки = Документ.ДатаРегистрации;
	Иначе
		ДатаСортировки = Документ.ДатаСоздания;
	КонецЕсли;
	
	// Запись в регистр ОбщиеРеквизитыДокументов
	НаборЗаписей = РегистрыСведений.ОбщиеРеквизитыДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьРегистра = НаборЗаписей[0];
	Иначе
		ЗаписьРегистра = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаписьРегистра.Документ					= Документ.Ссылка;
	ЗаписьРегистра.РегистрационныйНомер		= Документ.РегистрационныйНомер;
	ЗаписьРегистра.ДатаРегистрации			= Документ.ДатаРегистрации;
	ЗаписьРегистра.РегистрационныйНомерИДата= РегистрационныйНомерИДата;
	ЗаписьРегистра.ИсходящийНомерИДата		= ИсходящийНомерИДата;
	ЗаписьРегистра.Сумма					= Документ.Сумма;
	ЗаписьРегистра.Валюта					= Документ.Валюта;
	ЗаписьРегистра.СрокИсполнения			= Документ.СрокИсполнения;
	ЗаписьРегистра.Заголовок				= Документ.Заголовок;
	ЗаписьРегистра.КонтрагентыДляСписков	= КонтрагентыДляСписков;
	ЗаписьРегистра.ДатаСортировки			= ДатаСортировки;
	
	СписокРеквизитов = Новый Массив;
	СписокРеквизитов.Добавить("РегистрационныйНомер");
	СписокРеквизитов.Добавить("ДатаРегистрации");
	СписокРеквизитов.Добавить("РегистрационныйНомерИДата");
	СписокРеквизитов.Добавить("ИсходящийНомерИДата");
	СписокРеквизитов.Добавить("Сумма");
	СписокРеквизитов.Добавить("Валюта");
	СписокРеквизитов.Добавить("СрокИсполнения");
	СписокРеквизитов.Добавить("Заголовок");
	СписокРеквизитов.Добавить("КонтрагентыДляСписков");
	СписокРеквизитов.Добавить("ДатаСортировки");
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ИзмененоЗначение", СписокРеквизитов);
	НаборЗаписей.Записать();
	
	// Запись в регистры ДанныеДокументов
	Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		ИмяРегистра = "ДанныеВнутреннихДокументов";
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		ИмяРегистра = "ДанныеВходящихДокументов";
	ИначеЕсли ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		ИмяРегистра = "ДанныеИсходящихДокументов";
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ.Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьРегистра = НаборЗаписей[0];
	Иначе
		ЗаписьРегистра = НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Документ);
	ЗаписьРегистра.Документ = Документ.Ссылка;
	ЗаписьРегистра.ДатаСортировки = ДатаСортировки;
	ЗаписьРегистра.РегистрационныйНомерИДата = РегистрационныйНомерИДата;
	ЗаписьРегистра.КонтрагентыДляСписков = КонтрагентыДляСписков;
	Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда
		ЗаписьРегистра.ИсходящийНомерИДата = ИсходящийНомерИДата;
	КонецЕсли;
	
	Если ТипЗнч(Документ.Ссылка) = Тип("СправочникСсылка.ВнутренниеДокументы") Тогда
		Для Н = 1 По 2 Цикл
			Если Документ.Стороны.Количество() >= Н Тогда
				ЗаписьРегистра["Сторона" + Н] = Документ.Стороны[Н - 1].Сторона;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Записывает отметку о получении оригинала документа в регистр.
//
// Параметры:
//  Документ - ссылка на документ, для которого записывается реквизит.
//  Значение - Булево - значение реквизита.
//
Процедура ЗаписатьОтметкуОПолученииОригиналаДокумента(Документ, Значение) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.ОбщиеРеквизитыДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.ОригиналПолучен = Значение Тогда 
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Документ = Документ;
	МенеджерЗаписи.ОригиналПолучен = Значение;
	Если Значение = Истина Тогда 
		МенеджерЗаписи.ОригиналПолучил = ПользователиКлиентСервер.ТекущийПользователь();
		МенеджерЗаписи.ДатаПолученияОригинала = ТекущаяДатаСеанса();
	Иначе 
		МенеджерЗаписи.ОригиналПолучил = Справочники.Пользователи.ПустаяСсылка();
		МенеджерЗаписи.ДатаПолученияОригинала = Неопределено;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
